<template>
  <Dialog>
    <DialogTrigger as-child>
      <a href="#" class="underline underline-offset-2 text-primary">
        {{ text }}
      </a>
    </DialogTrigger>
    <DialogContent
      class="sm:max-w-[650px] grid-rows-[auto_minmax(0,1fr)_auto] p-0 max-h-[90dvh]"
    >
      <DialogHeader class="p-6 pb-0">
        <DialogTitle>ข้อตกลงและเงื่อนไขการใช้งาน</DialogTitle>
      </DialogHeader>
      <div class="grid gap-4 overflow-y-auto px-6">
        <div class="flex flex-col bg-slate-200 p-5">
          <p class="text-base pb-2">ด้านการใช้งานระบบ Charlie</p>
          <ul class="list-disc list-outside text-sm pl-7">
            <li>
              เนื่องจากระบบยังอยู่ในช่วงทดสอบ อาจจะให้ข้อมูลที่ผิดพลาดได้
              ในการลงทุนจริงหลังจากใช้งานนักลงทุนควรหาข้อมูลเพิ่มเติม
              หรือดูข้อมูลผ่านเว็บไซต์/แอปพลิเคชัน Finnomena อีกครั้ง
            </li>
            <li>
              บริษัทขอสงวนสิทธิ์ในข้อมูล รวมทั้งสูตรการคำนวณนี้
              ห้ามมิให้ผู้ใดใช้ประโยชน์ ทำซ้ำ ดัดแปลง นำออก
              แสดงทำให้ปรากฏหรือเผยแพร่ต่อสาธารณชน ไม่ว่าด้วยประการใด ๆ
              ซึ่งข้อมูลในเอกสารนี้ไม่ว่าทั้งหมด หรือบางส่วน
              เว้นแต่ได้รับอนุญาตเป็นหนังสือจากบริษัทเป็นการล่วงหน้า
            </li>
          </ul>
          <p class="text-base pb-2 pt-2">
            ด้านการลงทุนเพื่อสิทธิ์ประโยชน์ทางภาษี
          </p>
          <ul class="list-disc list-outside text-sm pl-7">
            <li>
              ระบบคำนวณยอดเงินลงทุนในกองทุนลดหย่อนภาษีนี้เป็นการคำนวณเพียงเบื้องต้น
              โดยใช้ข้อมูลจากกรมสรรพากรสำหรับปีภาษี 2567 เท่านั้น
              ทางบริษัทขอไม่รับรองความถูกต้องของข้อมูลและผลลัพธ์
              ในกรณีที่มีการเปลี่ยนแปลงข้อมูลเกี่ยวกับการลดหย่อนภาษี
              กรุณาตรวจสอบเพิ่มเติมจากประกาศของกรมสรรพากร
            </li>
            <li>
              ผู้ลงทุนควรศึกษาข้อมูลเกี่ยวกับสิทธิประโยชน์ทางภาษีที่ระบุไว้ในคู่มือการลงทุนในกองทุนรวมเพื่อสิทธิ์ประโยชน์ทางภาษีก่อนตัดสินใจลงทุน
              ผู้ลงทุนจะไม่ได้รับสิทธิประโยชน์ทางภาษี
              หากไม่ปฏิบัติตามเงื่อนไขการลงทุน
              และจะต้องคืนสิทธิประโยชน์ทางภาษีที่เคยได้รับภายในกำหนดเวลา
              มิฉะนั้นจะต้องชำระเงินเพิ่ม และ/หรือเบี้ยปรับตามประมวลรัษฎากร
            </li>
          </ul>
          <p class="text-base pb-2 pt-2">ด้านการให้คำแนะนำ</p>
          <ul class="list-disc list-outside text-sm pl-7">
            <li>
              กองทุนแนะนำและคำแนะนำในการจัดพอร์ตกองทุนประหยัดภาษีทั้งหมดเป็นคำแนะนำแบบทั่วไปจากบลน.ฟินโนมีนาจำกัด
              ระบบ Charlie เพียงแค่นำข้อมูลจากผู้ลงทุนเพื่อใช้ในการคำนวณเท่านั้น
            </li>
          </ul>

          <p class="text-base pb-2 pt-2">ด้านการลงทุนทั่วไป</p>
          <ul class="list-disc list-outside text-sm pl-7">
            <li>
              ผู้ลงทุนควรศึกษาข้อมูลสำคัญของกองทุนโดยเฉพาะนโยบายกองทุน
              ความเสี่ยง และผลการดำเนินงานของกองทุน
              โดยสามารถขอข้อมูลจากผู้แนะนำก่อนตัดสินใจลงทุน
            </li>
            <li>
              ผลการดำเนินงานในอดีต
              และผลการเปรียบเทียบผลการดำเนินงานที่เกี่ยวข้องกับผลิตภัณฑ์ในตลาดทุน
              มิได้เป็นสิ่งยืนยันถึงผลการดำเนินงานในอนาคต
            </li>
            <li>
              สำหรับกองทุนที่มีการลงทุนในต่างประเทศ
              ผู้ลงทุนอาจมีความเสี่ยงจากอัตราแลกเปลี่ยน
              เนื่องจากการป้องกันความเสี่ยงขึ้นอยู่กับดุลพินิจของผู้จัดการกองทุน
            </li>
            <li>
              สอบถามข้อมูลเพิ่มเติมหรือขอรับหนังสือชี้ชวนได้ที่บริษัทหลักทรัพย์นายหน้าซื้อขายหน่วยลงทุน
              ฟินโนมีนา จำกัด ในช่วงเวลาวันทำการตั้งแต่ 09:00-17:00 น.
              ที่หมายเลขโทรศัพท์ 02 026 5100 และทาง LINE “@FINNOMENAPORT"
            </li>
          </ul>
        </div>
      </div>
      <DialogFooter class="p-6 pt-0">
        <DialogClose as-child>
          <Button type="submit" @click="handleSubmit"> ปิด </Button>
        </DialogClose>
      </DialogFooter>
    </DialogContent>
  </Dialog>
</template>

<script>
import { Button } from "@/components/ui/button";
import {
  Dialog,
  DialogContent,
  DialogFooter,
  DialogHeader,
  DialogTitle,
  DialogTrigger,
} from "@/components/ui/dialog";

export default {
  props: {
    text: {
      type: String,
      required: true,
    },
  },
};
</script>
